
# State **`s3://infrahouse-website-infra/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        1 |           2 |          0 |
## Affected resources by action

|  Action  | Resources                                      |
|:--------:|:-----------------------------------------------|
|    🟢    | `module.website.aws_alb_listener_rule.website` |
|    🟡    | `module.website.aws_autoscaling_group.website` |
|    🟡    | `module.website.aws_lb_listener.ssl`           |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.website.aws_alb_listener_rule.website will be created
  + resource "aws_alb_listener_rule" "website" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20240913214119018400000001/899a5c5d81f7169f/bbb1d36949612f14"
      + priority     = 99
      + tags         = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "production"
          + "service"           = "website"
        }
      + tags_all     = {
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "production"
          + "service"           = "website"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240913200526502500000002/0d4217fd67c51e93"
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "infrahouse.com",
                ]
            }
        }
    }

  # module.website.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "web20231125205239428700000003"
        name                             = "web20231125205239428700000003"
        # (32 unchanged attributes hidden)

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_base_capacity                  = 1
              + on_demand_percentage_above_base_capacity = 0
            }
          + launch_template {
              + launch_template_specification {
                  + launch_template_id = "lt-042ea5dd55b0fff3b"
                  + version            = "9"
                }
              + override (known after apply)
            }
        }

        # (10 unchanged blocks hidden)
    }

  # module.website.aws_lb_listener.ssl will be updated in-place
  ~ resource "aws_lb_listener" "ssl" {
        id                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20240913214119018400000001/899a5c5d81f7169f/bbb1d36949612f14"
        tags              = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/website-pod/aws"
            "environment"       = "production"
            "service"           = "website"
        }
        # (7 unchanged attributes hidden)

      ~ default_action {
          ~ type             = "forward" -> "fixed-response"
            # (2 unchanged attributes hidden)

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "The server cannot or will not process the request due to an apparent client error (e.g., malformed request syntax, size too large, invalid request message framing, or deceptive request routing)."
              + status_code  = "400"
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS90ZXJyYWZvcm0udGZzdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJhZGQiOiAxLCAiY2hhbmdlIjogMiwgImRlc3Ryb3kiOiAwfX0=
```
</details>